# MeshTriangle Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
MeshTriangle Class
Members See Also
---
One triangle of a mesh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class MeshTriangle
```

Visual Basic
---
```text
Public Class MeshTriangle
```

Visual C++
---
```text
public ref class MeshTriangle
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..MeshTriangle
# See Also
MeshTriangle Members
Autodesk.Revit.DB Namespace